Repository: onuryilmazo/Diyabet-Makine-Ogrenmesi-Uygulamasi
Catalog: lib/l10n/intl_*.arb
Languages: tr

# title
source: Welcome
tr: Hoş Geldiniz

# onboardingDescription1
source: Discover the key to a healthy life. Our app will guide you through diabetes management and healthy living. Continue to start!
tr: Sağlıklı bir yaşamın anahtarını keşfedin. Uygulamamız, diyabet yönetimi ve sağlıklı yaşam konularında size rehberlik edecek. Başlamak için devam edin!

# diabetesTitle
source: What is Diabetes?
tr: Diyabet Nedir?

# diabetesDescription
source: Diabetes is a condition where blood sugar levels remain consistently high. There are two main types: Type 1 and Type 2. In Type 1 diabetes, the body cannot produce enough insulin. In Type 2 diabetes, the body cannot effectively use insulin. Both types can be managed with a healthy lifestyle and regular medical care.
tr: Diyabet, kandaki şeker seviyelerinin sürekli yüksek olması durumudur. İki ana tipi vardır: Tip 1 ve Tip 2. Tip 1 diyabette, vücut yeterince insülin üretemez. Tip 2 diyabette ise vücut insülini etkili şekilde kullanamaz. Her iki tip de sağlıklı bir yaşam tarzı ve düzenli tıbbi bakım ile yönetilebilir.

# howItWorksTitle
source: How It Works
tr: Nasıl Çalışır?

# howItWorksDescription
source: Fill in the required information and let our machine learning model predict diabetes for you based on the results.
tr: Sizden istenen bilgileri doldurun ve makine öğrenmesi modeli ile bu sonuçlara bakarak sizin için diyabet tahmini yapalım.

source: Skip
tr: Atla

source: Next
tr: İleri

source: Get Started
tr: Başlayın

source: Hello
tr: Selam

# enterWeight
source: Enter your weight (kg)
tr: Kilonuzu Giriniz (kg)

# enterHeight
source: Enter your height (m)
tr: Boyunuzu Giriniz (m)

source: Calculate
tr: Hesapla

# bmiResult
source: Your Body Mass Index
tr: Vücut Kitle Endeksiniz

source: Next Page
tr: Sonraki Sayfa

# pregnancyCount
source: Number of Pregnancies
tr: Gebelik Sayısı

source: Glucose Value
tr: Glukoz Değeri

source: Blood Pressure Value
tr: Kan Basıncı Değeri

source: Skin Thickness Value
tr: Deri İnceliği Değeri

source: Insulin Value
tr: İnsülin Değeri

# bmiValue
source: Body Mass Index Value
tr: Vücut Kitle İndeksi Değeri

# diabetesPedigree
source: How many generations have diabetes?
tr: Kaç nesildir diyabet hastalığı var?

source: Age
tr: Yaş

# calculateButton
source: Calculate
tr: Hesapla

source: Test Result
tr: Test Sonucu

source: Disease Status
tr: Hastalık Durumu
